<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN" "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head><link rel="stylesheet" type="text/css" href="/style/3col-2011/all.css"/>
	<title>SPARQL-intro: SPARQL 1.1</title>
	<meta name="keywords" content="RDF, SPARQL, Linked Data, Semantic Web"/>
	<meta name="copyright" content="2012 Luke McCarthy. This work is licensed under a Creative Commons License.   http://creativecommons.org/licenses/by-sa/3.0/"/>
</head>
<body><div id="frame1"><div id="header"><h1>ELM online</h1></div><div id="right-column"><div id="middle-column"><div id="left-column"><div id="content">
<h2 id="sparql1.1">SPARQL 1.1</h2>

<h3 id="aggregatefunctions">Aggregate functions</h3>

<p>SPARQL 1.1 will add aggregate functions (GROUP BY, HAVING, etc.), which are sorely missed in SPARQL 1.0. ARQ 2.8.8 supports some SPARQL 1.1 features, but the support must be turned on with the <code>--syntax ARQ</code> command-line option:</p>

<p><code>$ sparql --syntax ARQ --data <a href="../social.ttl" title="Simple social network">../social.ttl</a> --query <a href="count.sparql" title="Label">count.sparql</a></code></p>
<dl>
<dt>query:
</dt>
<dd>
<pre><code>PREFIX foaf: &lt;http://xmlns.com/foaf/0.1/&gt;
SELECT ?name COUNT(?connection)
WHERE {
    ?person a foaf:Person .
    ?person foaf:name ?name .
    ?person foaf:knows ?connection .
} GROUP BY ?name
</code></pre></dd>

<dt>results:
</dt>
<dd>
<pre><code>--------------------------
| name              | .1 |
==========================
| "Melanie Courtot" | 2  |
| "Mark Wilkinson"  | 3  |
| "Matt Links"      | 2  |
| "Luke McCarthy"   | 3  |
--------------------------
</code></pre></dd>
</dl>


<p>COUNT is just one of the aggregate functions supported by SPARQL 1.1. There is a complete list in the <a href="http://www.w3.org/TR/sparql11-query/#setFunctions" title="SPARQL 1.1 W3C Recommendation: set functions">SPARQL 1.1 W3C Recommendation</a></p>

<h3 id="calculation">Calculation</h3>

<p>SPARQL 1.1 will also support inline calculation. Here is an example that is support by ARQ (with the <code>--syntax ARQ</code> switch):</p>

<p><code>$ sparql --syntax ARQ --data <a href="../social.ttl" title="Simple social network">../social.ttl</a> --query <a href="bmi.sparql" title="Label">bmi.sparql</a></code></p>
<dl>
<dt>query:
</dt>
<dd>
<pre><code>PREFIX foaf: &lt;http://xmlns.com/foaf/0.1/&gt; 
PREFIX mged: &lt;http://mged.sourceforge.net/ontologies/MGEDOntology.owl#&gt; 
SELECT ?name ?bmi
WHERE {
    ?person a foaf:Person .
    ?person foaf:name ?name .
    ?person foaf:knows ?connection .
    ?person mged:height ?height .
    ?person mged:mass ?weight .
} GROUP BY ?name ((?weight / (?height * ?height)) as ?bmi)
</code></pre></dd>

<dt>results:
</dt>
<dd>
<pre><code>-----------------------------------------
| name            | bmi                 |
=========================================
| "Luke McCarthy" | 26.32017237098755e0 |
-----------------------------------------
</code></pre></dd>
</dl>


<p>No comment.</p>

<h3 id="notexistsclauses">NOT EXISTS clauses</h3>

<p>This is the FILTER( !BOUND(…) ) query from the previous section, reworked to take advantage of the SPARQL 1.1 <code>NOT EXISTS</code> clause (again, the <code>--syntax ARQ</code> switch is required):</p>

<p><code>$ sparql --syntax ARQ --data <a href="../social.ttl" title="Simple social network">../social.ttl</a> --query <a href="not-exists.sparql" title="Label">not-exists.sparql</a></code></p>
<dl>
<dt>query:
</dt>
<dd>
<pre><code>PREFIX foaf: &lt;http://xmlns.com/foaf/0.1/&gt;
SELECT ?person
WHERE {
    &lt;http://elmonline.ca/luke&gt; foaf:knows ?person .
    NOT EXISTS { &lt;http://www.linkedin.com/in/mcourtot&gt; foaf:knows ?person  . }
}
</code></pre></dd>

<dt>results:
</dt>
<dd>
<pre><code>----------------------------------------------------------
| person                                                 |
==========================================================
| &lt;http://www.linkedin.com/pub/matthew-links/44/381/647&gt; |
| &lt;http://www.linkedin.com/in/mcourtot&gt;                  |
----------------------------------------------------------
</code></pre></dd>
</dl>


<p><a href="../complex/" title="More complex SPARQL queries" class="prev">« Previous: More complex SPARQL queries «</a></p>
</div><div id="left-content">
                </div><div id="right-content">
                </div></div></div></div><div id="footer"><p>valid <a href="http://validator.w3.org/check/referer">HTML</a>
         and <a href="http://jigsaw.w3.org/css-validator/check/referer">CSS</a>.</p></div></div></body>
</html>
