<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN" "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head><link rel="stylesheet" type="text/css" href="/style/3col-2011/all.css"/>
	<title>SPARQL-intro: Exploring RDF data with SPARQL</title>
	<meta name="keywords" content="RDF, SPARQL, Linked Data, Semantic Web"/>
	<meta name="copyright" content="2012 Luke McCarthy. This work is licensed under a Creative Commons License.   http://creativecommons.org/licenses/by-sa/3.0/"/>
</head>
<body><div id="frame1"><div id="header"><h1>ELM online</h1></div><div id="right-column"><div id="middle-column"><div id="left-column"><div id="content">
<h2 id="exploringrdfdatawithsparql">Exploring RDF data with SPARQL</h2>

<h3 id="gettingalistoftypes">Getting a list of types</h3>

<p>A good place to start is finding out what kinds of things are in the data:</p>

<p><code>sparql --data <a href="../social.ttl" title="Simple social network">../social.ttl</a> --query <a href="types.sparql" title="List types of things">types.sparql</a></code></p>
<dl>
<dt>query:
</dt>
<dd>
<pre><code>SELECT DISTINCT ?type 
WHERE {
    [] a ?type
}
</code></pre></dd>

<dt>results:
</dt>
<dd>
<pre><code>--------------------------------------
| type                               |
======================================
| &lt;http://purl.org/dc/dcmitype/Text&gt; |
| &lt;http://xmlns.com/foaf/0.1/Person&gt; |
--------------------------------------
</code></pre></dd>
</dl>


<h3 id="describequeries">DESCRIBE queries</h3>

<p>We can use a DESCRIBE query to get basic information about an individual. Exactly what data DESCRIBE will return is up to the particular SPARQL implementation, but it is often simply every statement in which the specified entity is the subject. We don’t know any individuals in the dataset, so we’ll pick a random individual of a type we’re interested in:</p>

<p><code>sparql --data <a href="../social.ttl" title="Simple social network">../social.ttl</a> --query <a href="prefix.sparql" title="A SPARQL DESCRIBE query">describe.sparql</a></code></p>
<dl>
<dt>query:
</dt>
<dd>
<pre><code>PREFIX foaf: &lt;http://xmlns.com/foaf/0.1/&gt;
DESCRIBE ?subject
WHERE {
    ?subject a foaf:Person
} LIMIT 1
</code></pre></dd>

<dt>results:
</dt>
<dd>
<pre><code>@prefix dc:      &lt;http://purl.org/dc/terms/&gt; .
@prefix rdfs:    &lt;http://www.w3.org/2000/01/rdf-schema#&gt; .
@prefix dctype:  &lt;http://purl.org/dc/dcmitype/&gt; .
@prefix foaf:    &lt;http://xmlns.com/foaf/0.1/&gt; .
@prefix rdf:     &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
 
&lt;http://ca.linkedin.com/pub/matthew-links/44/381/647&gt;
    rdf:type      foaf:Person ;
    foaf:knows    &lt;http://www.linkedin.com/pub/mark-wilkinson/1/674/665&gt; ;
    foaf:knows    &lt;http://elmonline.ca/luke&gt; ;
    foaf:name     "Matt Links" .
</code></pre></dd>
</dl>


<p>Notice the <code>LIMIT</code> clause in the query. Also notice that the query returned RDF, rather than variable bindings.</p>

<p><a href="../first/" title="Your first SPARQL query" class="prev">« Previous: Your first SPARQL query «</a>
<a href="../complex/" title="More complex SPARQL queries" class="next">» Next: More complex SPARQL queries »</a></p>
</div><div id="left-content">
                </div><div id="right-content">
                </div></div></div></div><div id="footer"><p>valid <a href="http://validator.w3.org/check/referer">HTML</a>
         and <a href="http://jigsaw.w3.org/css-validator/check/referer">CSS</a>.</p></div></div></body>
</html>
